adobe-creative-cloud
altserver
anydesk
apparency
arduino
arduino-ide
autodesk-fusion
balenaetcher
brave-browser
discord
figma
firefox
flux-app
font-awesome-terminal-fonts
font-fira-code
font-fira-mono
font-fira-code-nerd-font
font-fira-mono-nerd-font
font-fontawesome
font-geist-mono-nerd-font
font-hack
font-hack-nerd-font
font-inter
font-menlo-for-powerline
font-meslo-for-powerline
font-meslo-lg
font-meslo-lg-nerd-font
font-roboto-mono-nerd-font
gitkraken
google-chrome
google-drive
goreleaser
iina
kaleidoscope
karabiner-elements
keka
keycastr
ngrok
notion
protonvpn
prusaslicer
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
raycast
setapp
shottr
slack
sourcetree
spotify
superslicer
suspicious-package
syntax-highlight
teamviewer
telegram
topnotch
transmission
tunnelblick
visual-studio-code
vlc
warp
zoom
